---
type: ModelCurve
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ModelCurve

`Autodesk.Revit.DB.ModelCurve` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ChangeToReferenceLine | — | `public void ChangeToReferenceLine ()` |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | IsReferenceLine | — | `public bool IsReferenceLine { get ; }` |
| Property | Parameter | — | `` |
| Property | Subcategory | — | `public GraphicsStyle Subcategory { get ; set ; }` |
| Property | TrussCurveType | — | `public TrussCurveType TrussCurveType { get ; set ; }` |